In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('gym_1.csv', sep=';', index_col='id', parse_dates=['date'])
df1

                   name        date  height  weight  age
id
1373913  Marisa Martins  02/05/2013     155      48   45
1109818    Rita Fonseca  28/08/2018     166      54   45

In [3]:
df2 = pd.read_csv('gym_2.csv', sep=';', index_col='id', parse_dates=['date'])
df2

C:\Users\fabio\AppData\Local\Temp\ipykernel_5132\3128552859.py:1: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df2 = pd.read_csv('gym_2.csv', sep=';', index_col='id', parse_dates=['date'])

                     name       date  height  weight  age
id
1767703    Manuel Martins 2003-01-25     179      85   24
1071208  Florbela Freitas 2008-09-26     166      53   28

In [4]:
df3 = pd.read_csv('gym_3.csv', sep=';', index_col='id')
df3

                   name  hours   status  children sex
id
1767703  Manuel Martins      6   single         0   M
1373913  Marisa Martins      3  married         2   F
1158813   Joana Freitas      3    widow         1   F

**Concat along the axis=0, add rows**

In [5]:
df_concat=pd.concat([df1,df2,df3])
df_concat

,name,date,height,weight,age,hours,status,children,sex
id,,,,,,,,,
1373913,Marisa Martins,02/05/2013,155.0,48.0,45.0,NaN,NaN,NaN,NaN
1109818,Rita Fonseca,28/08/2018,166.0,54.0,45.0,NaN,NaN,NaN,NaN
1767703,Manuel Martins,2003-01-25 00:00:00,179.0,85.0,24.0,NaN,NaN,NaN,NaN
1071208,Florbela Freitas,2008-09-26 00:00:00,166.0,53.0,28.0,NaN,NaN,NaN,NaN
1767703,Manuel Martins,NaN,NaN,NaN,NaN,6.0,single,0.0,M
1373913,Marisa Martins,NaN,NaN,NaN,NaN,3.0,married,2.0,F
1158813,Joana Freitas,NaN,NaN,NaN,NaN,3.0,widow,1.0,F

**Concat along the axis=1, add columns**

In [6]:
df_concat_cols_outter = pd.concat([df1,df3], axis=1)
df_concat_cols_outter

,name,date,height,weight,age,name,hours,status,children,sex
id,,,,,,,,,,
1373913,Marisa Martins,02/05/2013,155.0,48.0,45.0,Marisa Martins,3.0,married,2.0,F
1109818,Rita Fonseca,28/08/2018,166.0,54.0,45.0,NaN,NaN,NaN,NaN,NaN
1767703,NaN,NaN,NaN,NaN,NaN,Manuel Martins,6.0,single,0.0,M
1158813,NaN,NaN,NaN,NaN,NaN,Joana Freitas,3.0,widow,1.0,F

In [7]:
df_concat_cols_inner = pd.concat([df1,df3], axis=1, join='inner')
df_concat_cols_inner

,name,date,height,weight,age,name,hours,status,children,sex
id,,,,,,,,,,
1373913,Marisa Martins,02/05/2013,155,48,45,Marisa Martins,3,married,2,F

**Append, add rows**

In [9]:
df_append = df1.concat([df2, df3])
df_append

AttributeError: 'DataFrame' object has no attribute 'concat'

**Merge Dataframes**

In [ ]:
df_merge_left=pd.merge(df1,df3, how='left', on='id')
df_merge_left

In [ ]:
df_merge_right=pd.merge(df1,df3, how='right', on='id')
df_merge_right

In [ ]:
df_merge_inner=pd.merge(df1,df3, how='inner',on='id')
df_merge_inner

In [ ]:
df_merge_outer=pd.merge(df1,df3, how='outer', on='id')
df_merge_outer

In [ ]:
df_merge_cross = pd.merge(df1, df3, how='cross')
df_merge_cross

**Join DataFrames**

In [ ]:
df_join_left = df1.join(df3, lsuffix='df1')
df_join_left

In [ ]:
df_join_right = df1.join(df3, how = 'right',  lsuffix='df1')
df_join_right

In [ ]:
df_join_inner = df1.join(df3, how = 'inner',  lsuffix='df1')
df_join_inner

In [ ]:
df_join_outer = df1.join(df3, how = 'outer',  lsuffix='df1')
df_join_outer

**pivot, reshape DataFrame by given index / column / values**

In [ ]:
df4 = pd.DataFrame({'class':['cycle','cycle','cycle', 'pilates', 'pilates', 'pilates'],
                   'day':['0-Mon', '2-Wed', '5-Sat', '0-Mon', '1-Tue', '4-Fri'],
                   'hour': [12, 10, 15, 9, 10, 14],})
df4

In [ ]:
df_pivot = df4.pivot(index = 'class', columns = 'day', values = 'hour')
df_pivot

**Stack and unstack**

In [ ]:
df_stack=df_pivot.stack()
df_stack

In [ ]:
df_unstack=df_stack.unstack()
df_unstack

**Melt function**

In [ ]:
df_melt = df4.melt(id_vars='class', value_vars='day')
df_melt

**Pivot table**

In [ ]:
df_gym = pd.read_csv('gym2.csv', sep = ';')

In [ ]:
df_gym.head(3)

In [ ]:
df_gym.pivot_table(index='city', columns='status', values = 'age', aggfunc='mean' ).round(2)

**Groupby**

In [ ]:
df_gym.groupby('class')['name'].count()